---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotPlaceRebar
source: html/0c3906a4-66cc-6b33-3941-b96804479516.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotPlaceRebar Property

Can't find a host for Rebar.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceRebar { get; }
```